a = int(input("Введіть ціле число для змінної 1: "))
b = float(input("Введіть дробове число для змінної 2: "))
c = int(input("Введіть ціле число для змінної 3: "))
d = float(input("Введіть дробове число для змінної 4: "))

res = [
    a + b,
    a - c,
    a * d,
    b / d,
    c ** 2,
    a // c,
    b % d
]

N_elements = len(res)
print(f"Кількість елементів у списку: {N_elements}")
print("Парні елементи списку:")
for result in res:
    if result % 2 == 0:
        print(result)

if len(res) >= 5:
    res[1], res[4] = res[4], res[1]
    print("Елементи після заміни:")
    print(res)
else:
    print("Список має менше п’яти елементів, заміна не виконана.")

name = input("Введіть ваше прізвище та ім'я: ")
print("\nПовідомлення про виконавця лабораторної роботи:")
print(f"Виконавець: {name}")
print("Лабораторна робота виконана успішно!")
